# Analysis

1)  
2)  
3)

In [8]:
# Import Dependencies
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

In [9]:
# Import two CSV Files
city_data = "raw_data/city_data.csv"
ride_data = "raw_data/ride_data.csv"

city_data_df = pd.read_csv(city_data)
ride_data_df = pd.read_csv(ride_data)

In [10]:
# Preview city_data_df
city_data_df.head()

             city  driver_count   type
0      Kelseyland            63  Urban
1      Nguyenbury             8  Urban
2    East Douglas            12  Urban
3   West Dawnfurt            34  Urban
4  Rodriguezburgh            52  Urban

In [11]:
# Preview ride_data_df
ride_data_df.head()

          city                 date   fare        ride_id
0     Sarabury  2016-01-16 13:49:27  38.35  5403689035038
1    South Roy  2016-01-02 18:42:34  17.49  4036272335942
2  Wiseborough  2016-01-21 17:35:29  44.18  3645042422587
3  Spencertown  2016-07-31 14:53:22   6.87  2242596575892
4   Nguyenbury  2016-07-09 04:42:44   6.28  1543057793673

In [12]:
# Merge the CSV Files into one Data Frame and preview the combined data
ride_share_data = pd.merge(ride_data_df, city_data_df, on='city')
ride_share_data.head()

       city                 date   fare        ride_id  driver_count   type
0  Sarabury  2016-01-16 13:49:27  38.35  5403689035038            46  Urban
1  Sarabury  2016-07-23 07:42:44  21.76  7546681945283            46  Urban
2  Sarabury  2016-04-02 04:32:25  38.03  4932495851866            46  Urban
3  Sarabury  2016-06-23 05:03:41  26.82  6711035373406            46  Urban
4  Sarabury  2016-09-30 12:48:34  30.30  6388737278232            46  Urban

# Bubble Plot of Ride Sharing Data

In [37]:
# Bubble Plot the following data:
# Average Fare ($) Per City
# Total Number of Rides Per City
# Total Number of Drivers Per City
# City Type (Urban, Suburban, Rural)

# Find the range of fares to create the X axis
x_axis = np.arange(0,1625,1)

# Find the range of the Fare Cost to create the Y axis
#y_axis = 

# Urban Rides
urban_rides = ride_share_data[ride_share_data['type'] == "Urban"]
total_urban_fare = len(urban_rides)

# Suburban Rides
suburban_rides = ride_share_data[ride_share_data['type'] == "Suburban"]

# Rural Rides
rural_rides = ride_share_data[ride_share_data['type'] == "Rural"]

# Create the Labels
#plt.xlabel("Total Number of Ride (Per City)")
#plt.ylabel("Average Fare($)")
#plt.title("Pyber Ride Sharing Data")

# Create the Scatter Plots
#plt.scatter(x_axis, urban_rides)
# Show the plot

# Total Fares by City Type

In [ ]:
# Pie Chart of Total Fares by City Type

# Total Rides by City Type

In [ ]:
# Pie Chart of Total Rides by City Type

# Total Drivers by City Type

In [ ]:
# Pie Chart of Total Drivers by City Type